# Змінна min має число від 0 до 59.
# Визначити в яку чверть години потрапляє число,
# відповідно вивести на екран одне з значень: «перша», «друга», «третя» або «четверта».

def check(min)
    case min
        when 0 .. 15
            puts "перша"
        when 15 .. 30
            puts "друга"
        when 30 .. 45
            puts "третя"
        when 45 .. 60
            puts "четверта"
        else
            puts "невірний формат"
        end
end

check(12)
check(28)
check(43)
check(57)
check(-4)
check(70)
